In [3]:
!conda list numpy

# packages in environment at C:\ProgramData\Anaconda3:
#
# Name                    Version                   Build  Channel
numpy                     1.15.4           py37h19fb1c0_0
numpy-base                1.15.4           py37hc3f5095_0
numpydoc                  0.8.0                    py37_0

In [5]:
import numpy as np

Y = np.array([[1,2,3],[4,5,6],[7,8,9], [10,11,12]], dtype=np.float64)

np.save('my_array', Y)
Z = np.load('my_array.npy')

# We print Z
print()
print('Y = \n', Z)
print()

# We print information about Z
print('Y has dimensions:', Z.shape)
print('Y has a total of', Z.size, 'elements')
print('Y is an object of type:', type(Z))
print('The elements in Y are of type:', Z.dtype)

Y =
 [[ 1.  2.  3.]
 [ 4.  5.  6.]
 [ 7.  8.  9.]
 [10. 11. 12.]]

Y has dimensions: (4, 3)
Y has a total of 12 elements
Y is an object of type: <class 'numpy.ndarray'>
The elements in Y are of type: float64

In [6]:
print("{}\n{}\n{}".format(np.arange(10), np.arange(4, 10), np.arange(1, 14, 3)))

[0 1 2 3 4 5 6 7 8 9]
[4 5 6 7 8 9]
[ 1  4  7 10 13]

In [8]:
print(np.linspace(0, 25, 10))

[ 0.          2.77777778  5.55555556  8.33333333 11.11111111 13.88888889
 16.66666667 19.44444444 22.22222222 25.        ]

In [10]:
x = np.arange(20)
print(x)
print()
y = np.reshape(x, (4, 5))
print(y)

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19]

[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]]

In [14]:
# Create a rank 1 ndarray 
x = np.array([1, 2, 3, 4, 5])

# Create a rank 2 ndarray
Y = np.array([[1,2,3],[4,5,6],[7,8,9]])

print()
print(x)
print()
print(Y)

# Delete the first and last element of x
x = np.delete(x, [0,4])

# Delete the first row of y
Y = np.delete(Y, 0, axis=0)

# We delete the first and last column of y
Y = np.delete(Y, [0,2], axis=1)

print()
print(x)
print()
print(Y)

[1 2 3 4 5]

[[1 2 3]
 [4 5 6]
 [7 8 9]]

[2 3 4]

[[5]
 [8]]

In [16]:
# Create a rank 1 ndarray 
x = np.array([1, 2, 3, 4, 5])

# Create a rank 2 ndarray 
Y = np.array([[1,2,3],[4,5,6]])

print()
print(x)
print()
print(Y)

# Append the integers 6, 7, and to x
x = np.append(x, [6, 7, 8])

# Append a new row containing 7,8,9 to Y
Y = np.append(Y, [[7,8,9]], axis=0)

# Append a new column containing 9 and 10 to y
Y = np.append(Y,[[9],[10],[11]], axis=1)

print()
print(x)
print()
print(Y)

[1 2 3 4 5]

[[1 2 3]
 [4 5 6]]

[1 2 3 4 5 6 7 8]

[[ 1  2  3  9]
 [ 4  5  6 10]
 [ 7  8  9 11]]

In [18]:
# Create a rank 1 ndarray 
x = np.array([1, 2, 5, 6, 7])

# Create a rank 2 ndarray 
Y = np.array([[1,2,3],[7,8,9]])

print()
print(x)
print()
print(Y)

# Insert the integers 3 and 4
# between 2 and 5 in x
x = np.insert(x,2,[3,4])

# Insert a row between
# the first and last rows of Y
Y = np.insert(Y,1,[4,5,6],axis=0)

# Insert a column full of 5s between
# the first and second columns of Y
Y = np.insert(Y,1,5, axis=1)

print()
print(x)
print()
print(Y)

[1 2 5 6 7]

[[1 2 3]
 [7 8 9]]

[1 2 3 4 5 6 7]

[[1 5 2 3]
 [4 5 5 6]
 [7 5 8 9]]

In [20]:
# Create a rank 1 ndarray 
x = np.array([1,2])

# Create a rank 2 ndarray 
Y = np.array([[3,4],[5,6]])

print()
print(x)
print()
print(Y)

# Stack x on top of Y
z = np.vstack((x,Y))
print()
print(z)

# Stack x on the right of Y. We need to reshape x
# in order to stack it on the right of Y. 
w = np.hstack((Y,x.reshape(2,1)))
print()
print(w)

[1 2]

[[3 4]
 [5 6]]

[[1 2]
 [3 4]
 [5 6]]

[[3 4 1]
 [5 6 2]]

In [21]:
# Create a 4 x 5 ndarray that contains integers from 0 to 19
X = np.arange(20).reshape(4, 5)

print()
print('X = \n', X)

# Select all the elements that are in the 2nd through 4th rows
# and in the 3rd to 5th columns
Z = X[1:4,2:5]

print()
print('Z = \n', Z)

# Select the same elements as above using method 2
W = X[1:,2:5]

print()
print('W = \n', W)

# Select all the elements that are in the 1st through 3rd rows
# and in the 3rd to 5th columns
Y = X[:3,2:5]

print()
print('Y = \n', Y)

# Select all the elements in the 3rd row
v = X[2,:]

print()
print('v = ', v)

# Select all the elements in the 3rd column
q = X[:,2]

print()
print('q = ', q)

# Select all the elements in the 3rd column
# but return a rank 2 ndarray
R = X[:,2:3]

print()
print('R = \n', R)

X =
 [[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]]

Z =
 [[ 7  8  9]
 [12 13 14]
 [17 18 19]]

W =
 [[ 7  8  9]
 [12 13 14]
 [17 18 19]]

Y =
 [[ 2  3  4]
 [ 7  8  9]
 [12 13 14]]

v =  [10 11 12 13 14]

q =  [ 2  7 12 17]

R =
 [[ 2]
 [ 7]
 [12]
 [17]]

In [22]:
# Create a 4 x 5 ndarray that contains integers from 0 to 19
X = np.arange(20).reshape(4, 5)

# Create a rank 1 ndarray that will serve as indices to select elements from X
indices = np.array([1,3])

print()
print('X = \n', X)

# We print indices
print()
print('indices = ', indices)

# We use the indices ndarray to select the 2nd and 4th row of X
Y = X[indices,:]

# We use the indices ndarray to select the 2nd and 4th column of X
Z = X[:, indices]

print()
print('Y = \n', Y)
print()
print('Z = \n', Z)

X =
 [[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]]

indices =  [1 3]

Y =
 [[ 5  6  7  8  9]
 [15 16 17 18 19]]

Z =
 [[ 1  3]
 [ 6  8]
 [11 13]
 [16 18]]

In [24]:
# Create a 5 x 5 ndarray that contains integers from 0 to 24
X = np.arange(25).reshape(5, 5)

print()
print('X = \n', X)
print()
print('main diagonal =', np.diag(X))
print()
print('above the main diagonal =', np.diag(X, k=1))
print()
print('below the main diagonal = ', np.diag(X, k=-1))

X =
 [[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]
 [20 21 22 23 24]]

main diagonal = [ 0  6 12 18 24]

above the main diagonal = [ 1  7 13 19]

below the main diagonal =  [ 5 11 17 23]

In [25]:
# Create 3 x 3 ndarray with repeated values
X = np.array([[1,2,3],[5,2,8],[1,2,3]])

print()
print('X = \n', X)
print()
print('The unique elements in X are:',np.unique(X))

X =
 [[1 2 3]
 [5 2 8]
 [1 2 3]]

The unique elements in X are: [1 2 3 5 8]

In [26]:
# Create a 5 x 5 ndarray that contains integers from 0 to 24
X = np.arange(25).reshape(5, 5)

print()
print('Original X = \n', X)
print()

# We use Boolean indexing to select elements in X:
print('The elements in X that are greater than 10:', X[X > 10])
print('The elements in X that less than or equal to 7:', X[X <= 7])
print('The elements in X that are between 10 and 17:', X[(X > 10) & (X < 17)])

# We use Boolean indexing to assign the elements that are between 10 and 17 the value of -1
X[(X > 10) & (X < 17)] = -1

# We print X
print()
print('X = \n', X)

Original X =
 [[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]
 [20 21 22 23 24]]

The elements in X that are greater than 10: [11 12 13 14 15 16 17 18 19 20 21 22 23 24]
The elements in X that less than or equal to 7: [0 1 2 3 4 5 6 7]
The elements in X that are between 10 and 17: [11 12 13 14 15 16]

X =
 [[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 -1 -1 -1 -1]
 [-1 -1 17 18 19]
 [20 21 22 23 24]]

In [28]:
# Create two rank 1 ndarrays
x = np.array([1,2,3,4,5])
y = np.array([6,7,2,8,4])

print()
print('x = ', x)
print()
print('y = ', y)
print()

# Use set operations to compare x and y:
print('The elements that are both in x and y:', np.intersect1d(x,y))
print('The elements that are in x that are not in y:', np.setdiff1d(x,y))
print('All the elements of x and y:',np.union1d(x,y))

x =  [1 2 3 4 5]

y =  [6 7 2 8 4]

The elements that are both in x and y: [2 4]
The elements that are in x that are not in y: [1 3 5]
All the elements of x and y: [1 2 3 4 5 6 7 8]

In [29]:
# Create an unsorted rank 1 ndarray
x = np.random.randint(1,11,size=(10,))

print()
print('Original x = ', x)

# Sort x
print()
print('Sorted x (out of place):', np.sort(x))

# When we sort out of place the original array remains intact.
print()
print('x after sorting:', x)

Original x =  [8 5 8 8 7 2 3 2 8 4]

Sorted x (out of place): [2 2 3 4 5 7 8 8 8 8]

x after sorting: [8 5 8 8 7 2 3 2 8 4]

In [30]:
# Create an unsorted rank 1 ndarray
x = np.random.randint(1,11,size=(10,))

print()
print('Original x = ', x)

# Sort x using sort() as a method(in place)
# the original array is changed to the sorted array.
x.sort()

print()
print('x after sorting:', x)

Original x =  [2 7 3 7 8 7 3 8 9 5]

x after sorting: [2 3 3 5 7 7 7 8 8 9]

In [31]:
# Create an unsorted rank 2 ndarray
X = np.random.randint(1,11,size=(5,5))

print()
print('Original X = \n', X)

# Sort the columns of X
print()
print('X with sorted columns :\n', np.sort(X, axis = 0))

# Sort the rows of X
print()
print('X with sorted rows :\n', np.sort(X, axis = 1))

Original X =
 [[ 1  8  3 10  2]
 [10  8  6  6  7]
 [ 6  5  2  7  3]
 [ 5  7 10 10  2]
 [ 4  2  7  6  6]]

X with sorted columns :
 [[ 1  2  2  6  2]
 [ 4  5  3  6  2]
 [ 5  7  6  7  3]
 [ 6  8  7 10  6]
 [10  8 10 10  7]]

X with sorted rows :
 [[ 1  2  3  8 10]
 [ 6  6  7  8 10]
 [ 2  3  5  6  7]
 [ 2  5  7 10 10]
 [ 2  4  6  6  7]]

In [33]:
# Create a 5 x 5 ndarray with consecutive
# integers from 1 to 25 (inclusive).
X = np.arange(1, 26).reshape(5, 5)

# Use Boolean indexing to pick out only
#the odd numbers in the array
Y = X[X % 2 == 1]

print()
print(X)
print()
print(Y)

[[ 1  2  3  4  5]
 [ 6  7  8  9 10]
 [11 12 13 14 15]
 [16 17 18 19 20]
 [21 22 23 24 25]]

[ 1  3  5  7  9 11 13 15 17 19 21 23 25]

In [34]:
# Create a rank 1 ndarray
x = np.array([1,2,3])

# Create a 3 x 3 ndarray
Y = np.array([[1,2,3],[4,5,6],[7,8,9]])

# Create a 3 x 1 ndarray
Z = np.array([1,2,3]).reshape(3,1)

print()
print('x = ', x)
print()
print('Y = \n', Y)
print()
print('Z = \n', Z)
print()
print('x + Y = \n', x + Y)
print()
print('Z + Y = \n',Z + Y)

x =  [1 2 3]

Y =
 [[1 2 3]
 [4 5 6]
 [7 8 9]]

Z =
 [[1]
 [2]
 [3]]

x + Y =
 [[ 2  4  6]
 [ 5  7  9]
 [ 8 10 12]]

Z + Y =
 [[ 2  3  4]
 [ 6  7  8]
 [10 11 12]]

In [37]:
X = np.ones((4, 4))
Y = np.array([1, 2, 3, 4])
Z = X * Y
print()
print(X)
print()
print(Y)
print()
print(Z)

[[1. 1. 1. 1.]
 [1. 1. 1. 1.]
 [1. 1. 1. 1.]
 [1. 1. 1. 1.]]

[1 2 3 4]

[[1. 2. 3. 4.]
 [1. 2. 3. 4.]
 [1. 2. 3. 4.]
 [1. 2. 3. 4.]]

In [1]:
!conda list pandas

# packages in environment at C:\ProgramData\Anaconda3:
#
# Name                    Version                   Build  Channel
pandas                    0.23.4           py37h830ac7b_0

In [2]:
import pandas as pd

groceries = pd.Series(data = [30, 6, 'Yes', 'No'], index = ['eggs', 'apples', 'milk', 'bread'])
groceries
print('Groceries has shape:', groceries.shape)
print('Groceries has dimension:', groceries.ndim)
print('Groceries has a total of', groceries.size, 'elements')
print('The data in Groceries is:', groceries.values)
print('The index of Groceries is:', groceries.index)
print('Is bananas an index label in Groceries:', 'bananas' in groceries)
print('Is bread an index label in Groceries:', 'bread' in groceries)

Groceries has shape: (4,)
Groceries has dimension: 1
Groceries has a total of 4 elements
The data in Groceries is: [30 6 'Yes' 'No']
The index of Groceries is: Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')
Is bananas an index label in Groceries: False
Is bread an index label in Groceries: True

In [3]:
# We access elements in Groceries using index labels:

# We use a single index label
print('How many eggs do we need to buy:', groceries['eggs'])
print()
# we can access multiple index labels
print('Do we need milk and bread:\n', groceries[['milk', 'bread']]) 
print()
# we use loc to access multiple index labels
print('How many eggs and apples do we need to buy:\n', groceries.loc[['eggs', 'apples']]) 
print()

# We access elements in Groceries using numerical indices:

# we use multiple numerical indices
print('How many eggs and apples do we need to buy:\n',  groceries[[0, 1]]) 
print()
# We use a negative numerical index
print('Do we need bread:\n', groceries[[-1]]) 
print()
# We use a single numerical index
print('How many eggs do we need to buy:', groceries[0]) 
print()
# we use iloc to access multiple numerical indices
print('Do we need milk and bread:\n', groceries.iloc[[2, 3]])

How many eggs do we need to buy: 30

Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object

How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object

Do we need bread:
 bread    No
dtype: object

How many eggs do we need to buy: 30

Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

In [5]:
# Create a Pandas Series that stores a grocery list of just fruits
fruits= pd.Series(data = [10, 6, 3,], index = ['apples', 'oranges', 'bananas'])
print('Original grocery list of fruits:\n ', fruits)

# Perform basic element-wise operations using arithmetic symbols
print()
print('fruits + 2:\n', fruits + 2) # We add 2 to each item in fruits
print()
print('fruits - 2:\n', fruits - 2) # We subtract 2 from each item in fruits
print()
print('fruits * 2:\n', fruits * 2) # We multiply each item in fruits by 2 
print()
print('fruits / 2:\n', fruits / 2) # We divide each item in fruits by 2
print()

# Import NumPy as np to be able to use the mathematical functions
import numpy as np

# Apply different mathematical functions to all elements of fruits
print()
print('EXP(X) = \n', np.exp(fruits))
print() 
print('SQRT(X) =\n', np.sqrt(fruits))
print()
print('POW(X,2) =\n',np.power(fruits,2)) # We raise all elements of fruits to the power of 2

# Add 2 only to the bananas
print('Amount of bananas + 2 = ', fruits['bananas'] + 2)
print()

# Subtract 2 from apples
print('Amount of apples - 2 = ', fruits.iloc[0] - 2)
print()

# Multiply apples and oranges by 2
print('We double the amount of apples and oranges:\n', fruits[['apples', 'oranges']] * 2)
print()

# Divide apples and oranges by 2
print('We half the amount of apples and oranges:\n', fruits.loc[['apples', 'oranges']] / 2)

# Multiply our grocery list by 2 (* is compatible with integers and strings)
groceries * 2

Original grocery list of fruits:
  apples     10
oranges     6
bananas     3
dtype: int64

fruits + 2:
 apples     12
oranges     8
bananas     5
dtype: int64

fruits - 2:
 apples     8
oranges    4
bananas    1
dtype: int64

fruits * 2:
 apples     20
oranges    12
bananas     6
dtype: int64

fruits / 2:
 apples     5.0
oranges    3.0
bananas    1.5
dtype: float64


EXP(X) =
 apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

SQRT(X) =
 apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

POW(X,2) =
 apples     100
oranges     36
bananas      9
dtype: int64
Amount of bananas + 2 =  5

Amount of apples - 2 =  8

We double the amount of apples and oranges:
 apples     20
oranges    12
dtype: int64

We half the amount of apples and oranges:
 apples     5.0
oranges    3.0
dtype: float64

eggs          60
apples        12
milk      YesYes
bread       NoNo
dtype: object

In [6]:
import pandas as pd

# Create a dictionary of Pandas Series 
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}
print(type(items))

# Create a Pandas DataFrame by passing it a dictionary of Pandas Series
shopping_carts = pd.DataFrame(items)
shopping_carts

<class 'dict'>

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [11]:
# Create a dictionary of Pandas Series without indexes
data = {'Bob' : pd.Series([245, 25, 55]),
        'Alice' : pd.Series([40, 110, 500, 45])}

df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [13]:
# Create a dictionary of lists (arrays)
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

df = pd.DataFrame(data)
df

   Integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

In [14]:
# Create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# Create a DataFrame 
store_items = pd.DataFrame(items2)
store_items

   bikes  glasses  pants  watches
0     20      NaN     30       35
1     15     50.0      5       10

In [15]:
print('shopping_carts has shape:', shopping_carts.shape)
print('shopping_carts has dimension:', shopping_carts.ndim)
print('shopping_carts has a total of:', shopping_carts.size, 'elements')
print()
print('The data in shopping_carts is:\n', shopping_carts.values)
print()
print('The row index in shopping_carts is:', shopping_carts.index)
print()
print('The column index in shopping_carts is:', shopping_carts.columns)

shopping_carts has shape: (5, 2)
shopping_carts has dimension: 2
shopping_carts has a total of: 10 elements

The data in shopping_carts is:
 [[245. 500.]
 [ nan  40.]
 [ nan 110.]
 [ 25.  45.]
 [ 55.  nan]]

The row index in shopping_carts is: Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

The column index in shopping_carts is: Index(['Bob', 'Alice'], dtype='object')

In [16]:
# Create a DataFrame that only has Bob's data
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [17]:
# Create a DataFrame that only has selected items for both Alice and Bob
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [18]:
# Create a DataFrame that only has selected items for Alice
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'],
                                              columns = ['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

In [19]:
# Create a DataFrame and provide the row index
df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [39]:
# Create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [21]:
print()
print(store_items)
print()
print('How many bikes are in each store:\n', store_items[['bikes']])
print()
print('How many bikes and pants are in each store:\n', store_items[['bikes', 'pants']])
print()
print('What items are in Store 1:\n', store_items.loc[['store 1']])
print()
print('How many bikes are in Store 2:', store_items['bikes']['store 2'])

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

How many bikes are in each store:
          bikes
store 1     20
store 2     15

How many bikes and pants are in each store:
          bikes  pants
store 1     20     30
store 2     15      5

What items are in Store 1:
          bikes  glasses  pants  watches
store 1     20      NaN     30       35

How many bikes are in Store 2: 15

In [22]:
# Add a new column named shirts to our store_items DataFrame indicating
# the number of shirts in stock at each store: 15 in store 1 and 2 in store 2
store_items['shirts'] = [15,2]
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

In [23]:
# Make a new column called suits by adding the number of shirts and pants
store_items['suits'] = store_items['pants'] + store_items['shirts']
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

In [24]:
# Create a dictionary from a list of Python dictionaries
# with th number of items at the new store
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# We create new DataFrame with the new_items
# and provide an index labeled store 3
new_store = pd.DataFrame(new_items, index = ['store 3'])
new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

In [40]:
# Append store 3 to our store_items DataFrame
store_items = store_items.append(new_store, sort=False)
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10
store 3     20      4.0     30       35

In [41]:
# Add a new column using data from rows 1 and 2 in the watches column
store_items['new watches'] = store_items['watches'][1:]
store_items

         bikes  glasses  pants  watches  new watches
store 1     20      NaN     30       35          NaN
store 2     15     50.0      5       10         10.0
store 3     20      4.0     30       35         35.0

In [42]:
# Insert a new column with label shoes right before the column with numerical index 4
store_items.insert(4, 'shoes', [8,5,0])
store_items

         bikes  glasses  pants  watches  shoes  new watches
store 1     20      NaN     30       35      8          NaN
store 2     15     50.0      5       10      5         10.0
store 3     20      4.0     30       35      0         35.0

In [43]:
# Remove the new watches column
store_items.pop('new watches')
store_items

         bikes  glasses  pants  watches  shoes
store 1     20      NaN     30       35      8
store 2     15     50.0      5       10      5
store 3     20      4.0     30       35      0

In [44]:
# Remove the watches and shoes columns
store_items = store_items.drop(['watches', 'shoes'], axis = 1)
store_items

         bikes  glasses  pants
store 1     20      NaN     30
store 2     15     50.0      5
store 3     20      4.0     30

In [45]:
# Remove the store 2 and store 1 rows
store_items = store_items.drop(['store 2', 'store 1'], axis = 0)
store_items

         bikes  glasses  pants
store 3     20      4.0     30

In [46]:
# Change the column label bikes to hats
store_items = store_items.rename(columns = {'bikes': 'hats'})
store_items

         hats  glasses  pants
store 3    20      4.0     30

In [47]:
# Change the row label from store 3 to last store
store_items = store_items.rename(index = {'store 3': 'last store'})
store_items

            hats  glasses  pants
last store    20      4.0     30

In [50]:
# Change the row index to be the data in the pants column
store_items = store_items.set_index('pants')
store_items

       hats  glasses
pants
30       20      4.0

In [1]:
import pandas as pd

# Create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# Create a DataFrame and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [2]:
store_items.isnull()

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1  False     True  False   False  False  False    False
store 2  False    False  False   False  False  False    False
store 3  False    False  False    True  False   True    False

In [3]:
store_items.isnull().sum()

bikes      0
glasses    1
pants      0
shirts     1
shoes      0
suits      1
watches    0
dtype: int64

In [4]:
# Count the number of NaN values in store_items
x =  store_items.isnull().sum().sum()

print('Number of NaN values in our DataFrame:', x)

Number of NaN values in our DataFrame: 3

In [6]:
print('Number of non-NaN values in the columns of our DataFrame:\n', store_items.count())

Number of non-NaN values in the columns of our DataFrame:
 bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

In [7]:
store_items.dropna(axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 2     15     50.0      5     2.0      5    7.0       10

In [8]:
store_items.dropna(axis = 1)

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

In [9]:
store_items.fillna(0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      0.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     0.0     10    0.0       35

In [10]:
store_items.fillna(method = 'ffill', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [11]:
store_items.fillna(method = 'ffill', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     20.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

In [12]:
store_items.fillna(method = 'backfill', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     50.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [13]:
store_items.fillna(method = 'backfill', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     30.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    10.0   10.0   35.0     35.0

In [31]:
import pandas as pd
import numpy as np

# Since we will be working with ratings, we will set the precision of our 
# dataframes to one decimal place.
pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a series of books.
# The ratings given are in the range from 1 to 5, with 5 being the best score.
# The names of the books, the authors, and the ratings of each user are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet',
                          'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare',
                            ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

# Users that have np.nan values means that the user has not yet rated that book.
#Use the data above to create a Pandas DataFrame that has the following column # labels:
# 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'.
#Let Pandas automatically assign numerical row indices to the DataFrame. 

# Create a dictionary with the data given above
dat = {'Author': authors, 'Book Title': books, 'User 1': user_1, 'User 2': user_2, 'User 3': user_3, 'User 4': user_4}

# Use the dictionary to create a Pandas DataFrame
book_ratings = pd.DataFrame(dat)
book_ratings

# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4' and row indices 0 through 4.

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     NaN     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     NaN     4.0
3          H. G. Wells     The Time Machine     NaN     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     NaN     NaN     NaN     4.2

In [34]:
# Now replace all the NaN values in your DataFrame with the average rating in each column.
#Replace the NaN values in place.
# HINT: you can use the fillna() function with the keyword inplace = True, to do this.
book_ratings.fillna(book_ratings.mean(), axis = 0, inplace = True)
book_ratings

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     2.9     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     3.1     4.0
3          H. G. Wells     The Time Machine     2.5     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     2.5     3.8     4.0     4.2

In [33]:
# From the DataFrame above you can now pick all the books that had a rating of 5.
best_rated = book_ratings[(book_ratings == 5).any(axis = 1)]['Book Title'].values
print(best_rated)

['Great Expectations' 'The Time Machine']

In [41]:
# load Google stock data in a DataFrame
Google_stock = pd.read_csv('./goog-1.csv')

# Print some information about Google_stock
print('Google_stock is of type:', type(Google_stock))
print('Google_stock has shape:', Google_stock.shape)

Google_stock is of type: <class 'pandas.core.frame.DataFrame'>
Google_stock has shape: (3313, 7)

In [39]:
Google_stock.head()

         Date  Open  High   Low  Close  Adj Close    Volume
0  2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500
1  2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800
2  2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200
3  2004-08-24  55.3  55.4  51.5   52.1       52.1  15361800
4  2004-08-25  52.1  53.7  51.6   52.7       52.7   9257400

In [40]:
Google_stock.tail()

            Date   Open   High    Low  Close  Adj Close   Volume
3308  2017-10-09  980.0  985.4  976.1  977.0      977.0   891400
3309  2017-10-10  980.0  981.6  966.1  972.6      972.6   968400
3310  2017-10-11  973.7  990.7  972.2  989.2      989.2  1693300
3311  2017-10-12  987.5  994.1  985.0  987.8      987.8  1262400
3312  2017-10-13  992.0  997.2  989.0  989.7      989.7  1157700

In [42]:
Google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [43]:
Google_stock.describe()

         Open    High     Low   Close  Adj Close   Volume
count  3313.0  3313.0  3313.0  3313.0     3313.0  3.3e+03
mean    380.2   383.5   376.5   380.1      380.1  8.0e+06
std     223.8   225.0   222.5   223.9      223.9  8.4e+06
min      49.3    50.5    47.7    49.7       49.7  7.9e+03
25%     226.6   228.4   224.0   226.4      226.4  2.6e+06
50%     293.3   295.4   289.9   293.0      293.0  5.3e+06
75%     536.7   540.0   532.4   536.7      536.7  1.1e+07
max     992.0   997.2   989.0   989.7      989.7  8.3e+07

In [45]:
pd.set_option('precision', 6)
Google_stock.corr()

               Open      High       Low     Close  Adj Close    Volume
Open       1.000000  0.999904  0.999845  0.999745   0.999745 -0.564258
High       0.999904  1.000000  0.999834  0.999868   0.999868 -0.562749
Low        0.999845  0.999834  1.000000  0.999899   0.999899 -0.567007
Close      0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Adj Close  0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Volume    -0.564258 -0.562749 -0.567007 -0.564967  -0.564967  1.000000

In [46]:
data = pd.read_csv('./fake_company.csv')
data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991    Alice         HR   26   52000
4  1991      Bob         RD   31   50000
5  1991  Charlie      Admin   46   60000
6  1992    Alice      Admin   27   60000
7  1992      Bob         RD   32   52000
8  1992  Charlie      Admin   48   62000

In [47]:
# Total amount of money spent in salaries each year
data.groupby(['Year'])['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [48]:
# Average salary per year
data.groupby(['Year'])['Salary'].mean()

Year
1990    51000
1991    54000
1992    58000
Name: Salary, dtype: int64

In [49]:
# Total salary each employee received
# in all the years they worked for the company
data.groupby(['Name'])['Salary'].sum()

Name
Alice      162000
Bob        150000
Charlie    177000
Name: Salary, dtype: int64

In [51]:
# Salary distribution per department per year.
data.groupby(['Year', 'Department'])['Salary'].sum()

Year  Department
1990  Admin          55000
      HR             50000
      RD             48000
1991  Admin          60000
      HR             52000
      RD             50000
1992  Admin         122000
      RD             52000
Name: Salary, dtype: int64

In [61]:
data[['Year','Salary']].describe()

              Year        Salary
count     9.000000      9.000000
mean   1991.000000  54333.333333
std       0.866025   5147.815070
min    1990.000000  48000.000000
25%    1990.000000  50000.000000
50%    1991.000000  52000.000000
75%    1992.000000  60000.000000
max    1992.000000  62000.000000